---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.ConduitModified
source: html/734b7d6c-f47d-a081-4f80-c7e582807362.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.ConduitModified Property

The conduit has been modified to be in the opposite direction or insufficient space to create the required fittings.

## Syntax (C#)
```csharp
public static FailureDefinitionId ConduitModified { get; }
```